//==============================================
// 教学计划编制问题
//----------------------------------------------
// 作者：武重甫
// 学号：17032430
// 修订：2017年11月
//==============================================
#include <iostream>

using namespace std;

#include <String.h>
#include "Graph.h"


int main(int argc, char const *argv[])
{
    OLGraph G;
    int credits[] = {4, 3, 4, 3, 2, 5, 3, 4, 5, 5, 5, 1};
    VertexType ids[] = {"c1", "c2", "c3", "c4", "c5", "c6", "c7", "c8", "c9", "c10", "c11", "c12"};
    int Sq[][12] = {
        {0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 1},
        {0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0},
        {0, 0, 0, 0, 1, 0, 1, 1, 0, 0, 0},
        {0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0},
        {0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0},
        {0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0},
        {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
        {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
        {0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1},
        {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1},
        {0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0},
        {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
    };

    // 首先是构造出顶点数组
    // for (int i = 0; i < G.vexnum; i++)
    // {
    //     G.xlist[i].credit = credits[i];
    //     strcpy(G.xlist[i].id, ids[i]);
    // }

    // 然后是构造弧结点，这里可以选择现有的邻接矩阵来构造
    // for (int i = 0; i < G.vexnum; i++)
    // {

    //     for (int j = 0; j < G.vexnum; j++)
    //     {
            
    //     }
    // }
    


    system("pause");
    return 0;
}