//==============================================
// 教学计划编制问题
//----------------------------------------------
// 作者：武重甫
// 学号：17032430
// 修订：2017年11月
//==============================================
#include <iostream>

using namespace std;

#include <String.h>
#include "Graph.h"

int main(int argc, char const *argv[])
{
    OLGraph G;
    int credits[] = {4, 3, 4, 3, 2, 5, 3, 4, 5, 5, 5, 1};
    VertexType ids[] = {"c1", "c2", "c3", "c4", "c5", "c6", "c7", "c8", "c9", "c10", "c11", "c12"};
    int Sq[][12] = {
        {0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1},
        {0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0},
        {0, 0, 0, 0, 1, 0, 1, 1, 0, 0, 0, 0},
        {0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0},
        {0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0},
        {0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0},
        {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
        {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
        {0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1},
        {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1},
        {0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0},
        {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
    };
    // 将测试数据录入十字链表
    ResolveSq(credits, ids, Sq, G);
    // 打印测试数据
    PrintList(G);
    Course Co;
    Co.CT = new CourseTag[G.vexnum];
    ToplogicalSort(G, Co);
    cout << "level" << endl;
    PrintCourse(Co);

    system("pause");
    return 0;
}